In [7]:
import sqlite3

In [8]:
conn = sqlite3.connect("INSTRUCTOR.db")

In [9]:
cursor_obj = conn.cursor()

In [10]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [11]:
table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), COODE CHAR(2));"""

cursor_obj.execute(table)

print("Table is ready")

Table is ready

In [13]:
cursor_obj.execute("""insert into INSTRUCTOR values (2, "Raul", "Chong", "Markham", "CA"), (3, "Hima", "Vasudevan", "Chicago", "US");""")

In [14]:
statement = """SELECT * FROM INSTRUCTOR"""
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All the data
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [15]:
statement = """SELECT FNAME FROM INSTRUCTOR"""
cursor_obj.execute(statement)

print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
    print(row)

All the data
('Raul',)
('Hima',)

In [16]:
statement = """SELECT CITY FROM INSTRUCTOR"""
cursor_obj.execute(statement)

print("All the data")
output2 = cursor_obj.fetchmany(2)
for out in output2:
    print(out)

All the data
('Markham',)
('Chicago',)

In [17]:
import pandas as pd
df = pd.read_sql_query("select * from instructor;", conn)

In [18]:
df

   ID FNAME      LNAME     CITY COODE
0   2  Raul      Chong  Markham    CA
1   3  Hima  Vasudevan  Chicago    US

In [19]:
df.LNAME[0]

'Chong'

In [20]:
df.LNAME[1]

'Vasudevan'

In [21]:
df.shape

(2, 5)

In [22]:
conn.close()